moneybackend/1c/AccumulationRegisters/ДвиженияДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>ДвиженияДС</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Кошелек</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кошельки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Статья</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Статьи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

moneybackend/1c/AccumulationRegisters/БюджетРасходы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>БюджетРасходы</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Статья</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Статьи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

moneybackend/1c/AccumulationRegisters/БюджетДоходы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>БюджетДоходы</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Статья</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Статьи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

moneybackend/1c/CommonForms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура Обновить(Команда)
	ОбновитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновитьНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДвиженияДСОстатки.Кошелек КАК Кошелек,
		|	ДвиженияДСОстатки.СуммаОстаток КАК Сумма,
		|	NULL КАК Статья,
		|	NULL КАК Перерасход
		|ИЗ
		|	РегистрНакопления.ДвиженияДС.Остатки(
		|			&КонецВыбранныйМесяц,
		|			ВЫБОР
		|				КОГДА &Скрыть
		|					ТОГДА НЕ Кошелек.Скрыть
		|				ИНАЧЕ ИСТИНА
		|			КОНЕЦ) КАК ДвиженияДСОстатки
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	""Бюджет расходы"",
		|	ВЫБОР
		|		КОГДА БюджетОстатки.СуммаОборот > 0
		|			ТОГДА 0
		|		ИНАЧЕ -БюджетОстатки.СуммаОборот
		|	КОНЕЦ,
		|	БюджетОстатки.Статья,
		|	ВЫБОР
		|		КОГДА БюджетОстатки.СуммаОборот > 0
		|			ТОГДА БюджетОстатки.СуммаОборот
		|		ИНАЧЕ 0
		|	КОНЕЦ
		|ИЗ
		|	РегистрНакопления.БюджетРасходы.Обороты(&НачалоВыбранныйМесяц, &КонецВыбранныйМесяц, , Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)) КАК БюджетОстатки
		|
		|УПОРЯДОЧИТЬ ПО
		|	Сумма УБЫВ,
		|	Перерасход УБЫВ
		|АВТОУПОРЯДОЧИВАНИЕ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДвиженияДСОбороты.Период КАК Период,
		|	ДвиженияДСОбороты.СуммаРасход КАК СуммаРасход,
		|	ДвиженияДСОбороты.СуммаПриход КАК СуммаПриход
		|ИЗ
		|	РегистрНакопления.ДвиженияДС.Обороты(&НачалоПрошлогоМесяца, &КонецВыбранныйМесяц, Месяц, Статья <> ЗНАЧЕНИЕ(справочник.Статьи.ПустаяСсылка)) КАК ДвиженияДСОбороты
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	-БюджетОстатки.СуммаОборот КАК СуммаОборот
		|ИЗ
		|	РегистрНакопления.БюджетДоходы.Обороты(&НачалоТекущийМесяц, &КонецВыбранныйМесяц, , Проект = ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)) КАК БюджетОстатки";
	
	Запрос.УстановитьПараметр("Скрыть",Скрыть);
	Запрос.УстановитьПараметр("НачалоВыбранныйМесяц",НачалоМесяца(НаДату)); 
	Запрос.УстановитьПараметр("КонецВыбранныйМесяц",КонецДня(НаДату));
	Запрос.УстановитьПараметр("НачалоТекущийМесяц",НачалоМесяца(ТекущаяДатаСеанса())); 
	НачалоПрошлогоМесяца = НачалоМесяца(ДобавитьМесяц(НаДату,-1));
	Запрос.УстановитьПараметр("НачалоПрошлогоМесяца",НачалоПрошлогоМесяца);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса[0].Выбрать();
	Остатки.Очистить();
	СуммаБюджет = 0;
	
	Перерасход = 0;
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Наименование", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(100)));
	ТЗ.Колонки.Добавить("Перерасход", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(100)));
    ТЗ.Колонки.Добавить("Сумма", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(100)));
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ВыборкаДетальныеЗаписи.Кошелек = "Бюджет расходы" Тогда
			СуммаБюджет =  СуммаБюджет + ВыборкаДетальныеЗаписи.Сумма;
			Перерасход =  Перерасход + ВыборкаДетальныеЗаписи.Перерасход;

			//БюджетНазваниеСтатей  = БюджетНазваниеСтатей+ ?(ЗначениеЗаполнено(БюджетНазваниеСтатей),Символы.ПС,"")
			//	+ ВыборкаДетальныеЗаписи.Статья.Наименование + ": "+ Формат(ВыборкаДетальныеЗаписи.Сумма,"ЧДЦ=2");
			СтрокаТЗ = ТЗ.Добавить();
			СтрокаТЗ.Наименование = ВыборкаДетальныеЗаписи.Статья.Наименование;
			СтрокаТЗ.Сумма = Формат(ВыборкаДетальныеЗаписи.Сумма,"ЧДЦ=2");
			СтрокаТЗ.Перерасход = Формат(ВыборкаДетальныеЗаписи.Перерасход,"ЧДЦ=2");
			
				//БюджетОстатки  = БюджетОстатки+ ?(ЗначениеЗаполнено(БюджетОстатки),Символы.ПС + Символы.ПС,"")
		
		иначе
			строка = остатки.Добавить();
			ЗаполнитьЗначенияСвойств(строка,ВыборкаДетальныеЗаписи);
		КонецЕсли; 
		
		
	КонецЦикла;
	ИтогиПоТЧ		= Остатки.Итог("Сумма");
	Элементы.ОстаткиСумма.ТекстПодвала = Формат(ИтогиПоТЧ,"ЧДЦ=2");
	
	//БюджетОстатки =  "Итого: " + Формат(СуммаБюджет,"ЧДЦ=2")
	//	+ Символы.ПС + "Остаток ДС с учетом бюджета: " + Формат(ИтогиПоТЧ + СуммаБюджет,"ЧДЦ=2");
		
	СтрокаТЗ = ТЗ.Добавить();СтрокаТЗ = ТЗ.Добавить();
	СтрокаТЗ.Наименование = "Итого:";
	СтрокаТЗ.Сумма = Формат(СуммаБюджет,"ЧДЦ=2");
	СтрокаТЗ.Перерасход = Формат(Перерасход,"ЧДЦ=2");
	
	
	ВыборкаБюджетДоходы = РезультатЗапроса[2].Выбрать();
	СуммаБюджетДоходы = 0;
   	Если ВыборкаБюджетДоходы.Следующий() Тогда
		СуммаБюджетДоходы = ВыборкаБюджетДоходы.СуммаОборот;
	КонецЕсли;
	
	СтрокаТЗ = ТЗ.Добавить();
	СтрокаТЗ.Наименование = "Остаток ДС с учетом бюджета:";
	СтрокаТЗ.Сумма = Формат(ИтогиПоТЧ - СуммаБюджет + СуммаБюджетДоходы,"ЧДЦ=2");
		
	ВыборкаПриходыРасходы = РезультатЗапроса[1].Выбрать();
	РасходыПрошлыйМесяц = 0;
	РасходыТекущийМесяц = 0;
	ПриходыПрошлыйМесяц = 0;
	ПриходыТекущийМесяц = 0;

	Пока ВыборкаПриходыРасходы.Следующий() Цикл
		Если ВыборкаПриходыРасходы.Период = НачалоПрошлогоМесяца Тогда
			РасходыПрошлыйМесяц =  ВыборкаПриходыРасходы.СуммаРасход;
			ПриходыПрошлыйМесяц =  ВыборкаПриходыРасходы.СуммаПриход;
		ИначеЕсли ВыборкаПриходыРасходы.Период = НачалоМесяца(НаДату) Тогда
			РасходыТекущийМесяц =  ВыборкаПриходыРасходы.СуммаРасход;
			ПриходыТекущийМесяц =  ВыборкаПриходыРасходы.СуммаПриход;

		КонецЕсли; 
	КонецЦикла;
	Если РасходыПрошлыйМесяц = 0 Тогда
		РасхождениеРасходы = 0;
	иначе
		РасхождениеРасходы = (РасходыПрошлыйМесяц - РасходыТекущийМесяц)/РасходыПрошлыйМесяц*100;		
	КонецЕсли; 
		
	Если ПриходыТекущийМесяц = 0 Тогда
		РасхождениеПриходы = 100;
	иначе
		РасхождениеПриходы = (ПриходыТекущийМесяц- ПриходыПрошлыйМесяц )/ПриходыТекущийМесяц*100;		
	КонецЕсли; 
	
	СтруктураПараметры = Новый Структура;
	//СтруктураПараметры.Вставить("ПунктПорядкуИспользуется",ИСТИНА);
	//СтруктураПараметры.Вставить("ЦветШапки","eadbaf");
		СтруктураПараметры.Вставить("Заголовок1","Статья");
		СтруктураПараметры.Вставить("Заголовок2","Перерасход");
		СтруктураПараметры.Вставить("Заголовок3","Остаток");

	HTMLВиджет2 = СтрШаблон(ПолучитьТекстHTML2(),ТаблицаЗначенийВТаблицуХТМЛ(ТЗ,СтруктураПараметры));

	
	
	
	HTMLВиджет1 = СтрШаблон(ПолучитьТекстHTML1(),
	
	Формат(РасходыПрошлыйМесяц,"ЧДЦ=2; ЧН=0,00"),
	Формат(ПриходыПрошлыйМесяц,"ЧДЦ=2; ЧН=0,00"),
	Формат(РасходыТекущийМесяц,"ЧДЦ=2; ЧН=0,00"),
	Формат(ПриходыТекущийМесяц,"ЧДЦ=2; ЧН=0,00"),
	?(РасхождениеРасходы<0,"<td data-negative>","<td data-positive>")
	 + Формат(РасхождениеРасходы,"ЧДЦ=2") + "&#37;</td>",
	 ?(РасхождениеПриходы<0,"<td data-negative>","<td data-positive>")
	 + Формат(РасхождениеПриходы,"ЧДЦ=2") + "&#37;</td>");

КонецПроцедуры

Функция ПолучитьТекстHTML1()
	Возврат "<html><head>
	|<style>
	| [data-negative] {
	| color: red;
	|}
	| [data-positive] {
	| color: green;
	|}
	|table {
	|border-spacing: 0;
	|empty-cells: hide;
	|font-family: ""Arial"";
	|font-size: 10px;
	|}
	|td {
	|padding: 10px 20px;
	|text-align: center;
	|border-bottom: 1px solid #F4EEE8;
	|transition: all 0.2s linear;
	|}
	|td:first-child {
	|text-align: left;
	|color: #3D3511;
	|font-weight: bold;
	|}
	|th {
	|padding: 10px 20px;
	|color: #3D3511;
	|border-bottom: 1px solid #F4EEE8;
	|border-top-left-radius: 10px;
	|border-top-right-radius: 10px;
	|}
	|td:nth-child(even) {
	|background: #FFE4E1;
	|}
	|td:nth-child(odd) {
	|background: #F0FFF0;
	|}
	|th:nth-child(even)  {
	|background: #FFE4E1;
	|}
	|th:nth-child(odd)  {
	|background: #F0FFF0;
	|}
	|.round-top {
	|border-top-left-radius: 5px;
	|}
	|.round-bottom {
	|border-bottom-left-radius: 5px;
	|}
	|tr:hover td{
	|background: #F0F8FF;
	|font-weight: bold;
	|}
	|</style>
	|
	|</head>
	|<body bgcolor=""#FFFACD"">
	|<table class=""zebra"">
	|<tbody>
	|<tr>
	|  <th></th>
	|  <th>Расход</th>
	|  <th>Приход</th>
	|</tr>
	|<tr>
	|<td class=""round-top"">прошлый месяц:</td>
	|<td>%1</td>
	|<td>%2</td>
	|</tr>
	|<tr>
	|<td>текущий месяц:</td>
	|<td>%3</td>
	|<td>%4</td>
	|</tr>
	|<tr>
	|  
	|<td class=""round-bottom"">расхождение:</td>
	|  
	|%5
	|%6               
	|</tr>
	|</tbody></table></body></html>";
КонецФункции



Функция ПолучитьТекстHTML2()
	Возврат "<html><head>
	|<style>
	| [data-negative] {
	| color: red;
	|}
	| [data-positive] {
	| color: green;
	|}
	|table {
	|border-spacing: 0;
	|empty-cells: hide;
	|font-family: ""Arial"";
	|font-size: 10px;
	|color: #191970;
	|text-decoration: underline;
	

	|}
	|td {
	|padding: 8px 20px;
	|text-align: center;
	|border-bottom: 1px solid #F4EEE8;
	|transition: all 0.2s linear;
	|}
	|td:first-child {
	|text-align: left;
	|color: #3D3511;
	|font-weight: bold;
	|text-decoration: underline;

	|}
	|th {
	|padding: 10px 20px;
	|color: #3D3511;
	|border-bottom: 1px solid #F4EEE8;
	|border-top-left-radius: 10px;
	|border-top-right-radius: 10px;
	|}
	|td:nth-child(even) {
	|background: #FFE4E1;
	|}
	|td:nth-child(odd) {
	|background: #F0FFF0;
	|}
	|th:nth-child(even)  {
	|background: #FFE4E1;
	|}
	|th:nth-child(odd)  {
	|background: #F0FFF0;
	|}
	|.round-top {
	|border-top-left-radius: 5px;
	|}
	|.round-bottom {
	|border-bottom-left-radius: 5px;
	|}
	|tr:hover td{
	|background: #F0F8FF;
	|font-weight: bold;
	|}
	|</style>
	|
	|</head>
	|<body bgcolor=""#F5F5DC"">
	|<table class=""zebra"">
	|%1</table></body></html>";
КонецФункции
 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Скрыть = Истина;
	НаДату = ТекущаяДатаСеанса();
	ОбновитьНаСервере();
КонецПроцедуры


&НаКлиенте
Процедура СкрытьПриИзменении(Элемент)
	ОбновитьНаСервере();
КонецПроцедуры


&НаКлиенте
Процедура HTMLВиджетПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	//HTMLПриНажатии(
	//	Этаформа, Элемент, ДанныеСобытия, СтандартнаяОбработка);
	ПерейтиПоНавигационнойСсылке("e1cib/app/Отчет.ОтчетПоДвижениюДС");
КонецПроцедуры

 

//Взято отсюда https://infostart.ru/1c/articles/717412/
// примеры там же
Функция ТаблицаЗначенийВТаблицуХТМЛ(ТабЗначений,СтруктураПараметрыТаблицыХТМЛ = Неопределено) Экспорт
	
	//СтруктураПараметрыТаблицыХТМЛ
	//
	//Общие параметры:
	//СтруктураПараметрыТаблицыХТМЛ.ШиринаТаблицы - общая ширина таблица
	//СтруктураПараметрыТаблицыХТМЛ.ЦветШапки - цвет шапки таблицы пример "eadbaf"
	//СтруктураПараметрыТаблицыХТМЛ.ПунктПорядкуИспользуется - по умолчанию ЛОЖЬ
	//
	//Индивиуальные для каждой колонки:
	//СтруктураПараметрыТаблицыХТМЛ.Заголовок1 - заголовок для первой колонки, цифра на конце обознает номер колонки (не с нуля)
	//СтруктураПараметрыТаблицыХТМЛ.Ширина1 - ширина для первой колонки, цифра на конце обознает номер колонки (не с нуля)
	//СтруктураПараметрыТаблицыХТМЛ.Положение1 - отвечает за положение текста в колонке (по умол. лево), передовать "center" или "right"
	
	//ТабЗначений = Новый ТаблицаЗначений;
	МассивИменКолонок = Новый Массив;
	
	Если ТипЗнч(СтруктураПараметрыТаблицыХТМЛ) <> Тип("Структура") Тогда
		СтруктураПараметрыТаблицыХТМЛ = Новый Структура;
	КонецЕсли;
				
	КоличествоКолонок = ТабЗначений.Колонки.Количество();
	ПунктПорядкуИспользуется = ?(СтруктураПараметрыТаблицыХТМЛ.Свойство("ПунктПорядкуИспользуется"),СтруктураПараметрыТаблицыХТМЛ.ПунктПорядкуИспользуется,ЛОЖЬ);	
	
	Если КоличествоКолонок < 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
			
	ЦветШапки = ?(СтруктураПараметрыТаблицыХТМЛ.Свойство("ЦветШапки")," bgcolor=""#" + СтруктураПараметрыТаблицыХТМЛ.ЦветШапки + """","");
	ШиринаТаблицы = ?(СтруктураПараметрыТаблицыХТМЛ.Свойство("ШиринаТаблицы")," style=""width:" + СтруктураПараметрыТаблицыХТМЛ.ШиринаТаблицы + "px""",""); 
	ТаблицаХТМЛ = "<table  cellpadding=""1"" cellspacing=""0"" " + ШиринаТаблицы + ">
				|<tbody>
				|<tr>";
	
	//Первым выводим столбик П/П если он задан в шапку
	Если ПунктПорядкуИспользуется Тогда
		ТаблицаХТМЛ = ТаблицаХТМЛ + "
				|<td" + ЦветШапки + " style=""width:30px"" align=""center"">п/п</td>";	
	КонецЕсли;
	
	//Формируем шапку
	Для Счетчик = 1 по КоличествоКолонок Цикл
		ИмяСвойстваШирина = "Ширина" + Счетчик;
		ШиринаСтолбца = ?(СтруктураПараметрыТаблицыХТМЛ.Свойство(ИмяСвойстваШирина)," style=""width:" + СтруктураПараметрыТаблицыХТМЛ[ИмяСвойстваШирина] + "px""","");
		ИмяКолонки = ТабЗначений.Колонки[Счетчик-1].Имя;
		ИмяСвойстваЗаголовок = "Заголовок" + Счетчик;
		ЗаголовокКолонки = ?(СтруктураПараметрыТаблицыХТМЛ.Свойство(ИмяСвойстваЗаголовок),СтруктураПараметрыТаблицыХТМЛ[ИмяСвойстваЗаголовок],ИмяКолонки);
		ТаблицаХТМЛ = ТаблицаХТМЛ + " 
				|<th" + ЦветШапки + ШиринаСтолбца + " align=""center"">" + ЗаголовокКолонки + "</th>";	
		МассивИменКолонок.Добавить(ИмяКолонки);
	КонецЦикла;
	ТаблицаХТМЛ = ТаблицаХТМЛ + "
				|</tr>";
	
	//Заполняем таблицу	
	ПунктПорядку = 0;
	Для каждого СтрокаТаблицы Из ТабЗначений Цикл
		ПунктПорядку = ПунктПорядку + 1;
		ТаблицаХТМЛ = ТаблицаХТМЛ + "
				|<tr>" + ?(ПунктПорядкуИспользуется, Символы.ПС + "<td align=""center"">" + ПунктПорядку + "</td>","") + "";
		Для Счетчик = 0 по КоличествоКолонок - 1 Цикл
			ИмяСвойстваПоложение = "Положение" + Строка(Счетчик + 1);
			Положение = " align=""" + ?(СтруктураПараметрыТаблицыХТМЛ.Свойство(ИмяСвойстваПоложение),СтруктураПараметрыТаблицыХТМЛ[ИмяСвойстваПоложение],"left") + """";
			ТаблицаХТМЛ = ТаблицаХТМЛ + "
				|<td " + Положение + ">" + СтрокаТаблицы[МассивИменКолонок[Счетчик]] + "</td>";			
		КонецЦикла;				
		ТаблицаХТМЛ = ТаблицаХТМЛ + "
				|</tr>";
	КонецЦикла;	
	
	ТаблицаХТМЛ = ТаблицаХТМЛ + " 
				|</tbody>
				|</table>";
	
	ТаблицаХТМЛ=СтрЗаменить (ТаблицаХТМЛ, "center'", "center;'");
    ТаблицаХТМЛ=СтрЗаменить (ТаблицаХТМЛ, "right'", "right;'");
    ТаблицаХТМЛ=СтрЗаменить (ТаблицаХТМЛ, "justify'", "justify;'");

	
	Возврат ТаблицаХТМЛ;

КонецФункции


&НаКлиенте
Процедура HTMLВиджет2ПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	Если ДанныеСобытия.Element.parentNode.children[0].textContent = "Остаток ДС с учетом бюджета:"
		
		
		или ДанныеСобытия.Element.parentNode.children[0].textContent = "Итого:"
				Тогда
		ПерейтиПоНавигационнойСсылке("e1cib/app/Отчет.Бюджетирование");
	Иначе
		Статья	= ПолучитьСсылкуПоНаименованию(ДанныеСобытия.Element.parentNode.children[0].textContent);
		Если не Статья.Пустая() Тогда
			ФиксированныеНастройки			= Новый НастройкиКомпоновкиДанных;
			ЭлементОтбора					= ФиксированныеНастройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбора.РежимОтображения	= РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
			ЭлементОтбора.ЛевоеЗначение		= Новый ПолеКомпоновкиДанных("Статья");
			ЭлементОтбора.ВидСравнения		= ВидСравненияКомпоновкиДанных.Равно;
			ЭлементОтбора.ПравоеЗначение	= Статья;
			ЭлементОтбора.Использование		= Истина; 
			
			ЭлементОтбора					= ФиксированныеНастройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбора.РежимОтображения	= РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
			ЭлементОтбора.ЛевоеЗначение		= Новый ПолеКомпоновкиДанных("Период");
			ЭлементОтбора.ВидСравнения		= ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
			ЭлементОтбора.ПравоеЗначение	= НачалоМесяца(НаДату);
			ЭлементОтбора.Использование		= Истина;  
			
			ЭлементОтбора					= ФиксированныеНастройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбора.РежимОтображения	= РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
			ЭлементОтбора.ЛевоеЗначение		= Новый ПолеКомпоновкиДанных("Период");
			ЭлементОтбора.ВидСравнения		= ВидСравненияКомпоновкиДанных.МеньшеИлиРавно;
			ЭлементОтбора.ПравоеЗначение	= КонецМесяца(НаДату);
			ЭлементОтбора.Использование		= Истина;  
			
			ПараметрыФормы					= Новый Структура("ФиксированныеНастройки, КлючНазначенияИспользования, КлючВарианта, СформироватьПриОткрытии", ФиксированныеНастройки, "Расшифровка", "Расшифровка", Истина);
			ОткрытьФорму("Отчет.Бюджетирование.Форма", ПараметрыФормы,,);
		КонецЕсли;
	КонецЕсли;	
	
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСсылкуПоНаименованию(Наименование)
	Статья = Справочники.Статьи.НайтиПоНаименованию(Наименование,Истина);
	Возврат Статья; 
КонецФункции

&НаКлиенте
Процедура НаДатуПриИзменении(Элемент)
	ОбновитьНаСервере();
КонецПроцедуры
